In [1]:
print("hello")

hello

In [52]:
import pandas as pd
import numpy as np

series

In [4]:
#series is a one-dimensional labeled array capable of holding any data type.
# It is similar to a list or an array, but with additional features like labels (index
#) for each element.
# A Series can be created from a list, dictionary, or another array-like object.
# Example of creating a Series from a list
s=pd.Series([1, 2, 3, 4, 5])
print("Series from list:")
print(s)

#if you create a series of multiple data types, it will automatically convert them to a common type (usually object).
# Example of creating a Series with mixed data types
s_mixed = pd.Series([1, 'two', 3.0, True])
print("\nSeries with mixed data types:")
print(s_mixed)

Series from list:
0    1
1    2
2    3
3    4
4    5
dtype: int64

Series with mixed data types:
0       1
1     two
2     3.0
3    True
dtype: object

operations of series

In [15]:
#operations on Series
# You can perform various operations on Series, such as arithmetic operations, statistical calculations, and more
# Example of arithmetic operations on Series
s1 = pd.Series([10, 20, 30])
s2 = pd.Series([1, 2, 3])
s_sum = s1 + s2
print("\nSum of two Series:")
print(s_sum)
# Example of statistical calculations on Series
s_mean = s1.mean()
print("\nMean of Series s1:")
print(s_mean)
s.index
s.dtype
s.values
s.name="calories"

Sum of two Series:
0    11
1    22
2    33
dtype: int64

Mean of Series s1:
20.0

indexing

In [16]:
#indexing in Series
print(s[0])
print(s[2])
print(s[1:4])  # Slicing

#iloc is used for integer-location based indexing
print(s.iloc[0])  # First element
print(s.iloc[1:4])  # Slicing using iloc

1
3
1    2
2    3
3    4
Name: calories, dtype: int64
1
1    2
2    3
3    4
Name: calories, dtype: int64

In [33]:
fruits = pd.Series(['apple', 'banana', 'cherry'], index=['a', 'b', 'c'])
print("\nSeries with custom index:")    
fruits.name="Fruits"
print(fruits)
# fruits.iloc['b'] iloc is only for integer-based indexing, so it cannot be used with string labels.
# To access elements by label, you can use the loc indexer.
print("\n")
fruits.loc['b']  # Accessing element with label 'b'
print(fruits["appple":"cherry"])

Series with custom index:
a     apple
b    banana
c    cherry
Name: Fruits, dtype: object


b    banana
c    cherry
Name: Fruits, dtype: object

create a series using dictonaries

In [38]:
fruit_protein = {
    "Avocado": 2.0,       # grams of protein
    "Guava": 2.6,
    "Blackberries": 2.0,
    "Oranges": 0.9,
    "Banana": 1.1,
    "Apples": 0.3,
    "Kiwi": 1.1,
    "Pomegranate": 1.7,
    "Mango": 0.8,
    "Cherries": 1.0
}
s2=pd.Series(fruit_protein, name="protien")
print(s2)

Avocado         2.0
Guava           2.6
Blackberries    2.0
Oranges         0.9
Banana          1.1
Apples          0.3
Kiwi            1.1
Pomegranate     1.7
Mango           0.8
Cherries        1.0
Name: protien, dtype: float64

conditional selections

In [44]:
#fetch values based on the conidtion
#fetch all the fruits which has protien more than 1.5
print(s2>1.5)
print("\n")
#i want only those which have protien more than 1.5g
print(s2[s2>1.5])

Avocado          True
Guava            True
Blackberries     True
Oranges         False
Banana          False
Apples          False
Kiwi            False
Pomegranate      True
Mango           False
Cherries        False
Name: protien, dtype: bool


Avocado         2.0
Guava           2.6
Blackberries    2.0
Pomegranate     1.7
Name: protien, dtype: float64

logical operators

In [ ]:
#logical operators
#i want all the fruits which have protien more than 1g and less than 2g
print((s2>1)&(s2<2))
print("\n")
print(s2[(s2>1)&(s2<=2)])

Avocado         False
Guava           False
Blackberries    False
Oranges         False
Banana           True
Apples          False
Kiwi             True
Pomegranate      True
Mango           False
Cherries        False
Name: protien, dtype: bool


Avocado         2.0
Guava           2.6
Blackberries    2.0
Oranges         0.9
Banana          1.1
Apples          0.3
Kiwi            1.1
Pomegranate     1.7
Mango           0.8
Cherries        1.0
Name: protien, dtype: float64

modifiing the series

In [ ]:
s2["mango"]=3
print(s2)

Avocado         2.0
Guava           2.6
Blackberries    2.0
Oranges         0.9
Banana          1.1
Apples          0.3
Kiwi            1.1
Pomegranate     1.7
Mango           0.8
Cherries        1.0
mango           3.0
Name: protien, dtype: float64

data frames

In [56]:
import numpy as np
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Alice"],
    "Age": [25, 30, 35, np.nan, 29, 25],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "HR"],
    "Salary": [50000, 60000, 70000, 62000, np.nan, 50000]
}
df=pd.DataFrame(data)
print(df)

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [57]:
df.head(2)

    Name   Age Department   Salary
0  Alice  25.0         HR  50000.0
1    Bob  30.0         IT  60000.0

In [59]:
df.tail(3)

    Name   Age Department   Salary
3  David   NaN         IT  62000.0
4    Eve  29.0         HR      NaN
5  Alice  25.0         HR  50000.0

In [ ]:
#loc and iloc function
df.iloc[1:3]

      Name   Age Department   Salary
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0

In [61]:
df.loc[1:3,["Age","Department"]]

    Age Department
1  30.0         IT
2  35.0    Finance
3   NaN         IT

In [ ]:
#u can also do using numbers
df.iloc[1:3,:2] #rows #cols #range slicing

      Name   Age
1      Bob  30.0
2  Charlie  35.0

In [65]:
#access individual cols
df[["Age","Department"]]

    Age Department
0  25.0         HR
1  30.0         IT
2  35.0    Finance
3   NaN         IT
4  29.0         HR
5  25.0         HR

In [ ]:
#removing the age col
df.drop("Age",axis=1)

      Name Department   Salary
0    Alice         HR  50000.0
1      Bob         IT  60000.0
2  Charlie    Finance  70000.0
3    David         IT  62000.0
4      Eve         HR      NaN
5    Alice         HR  50000.0

In [67]:
df

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [68]:
df.shape

(6, 4)

In [69]:
df.dtypes

Name           object
Age           float64
Department     object
Salary        float64
dtype: object

In [71]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      object
 1   Age         5 non-null      float64
 2   Department  6 non-null      object
 3   Salary      5 non-null      float64
dtypes: float64(2), object(2)
memory usage: 324.0+ bytes

In [72]:
df.describe()

             Age        Salary
count   5.000000      5.000000
mean   28.800000  58400.000000
std     4.147288   8532.291603
min    25.000000  50000.000000
25%    25.000000  50000.000000
50%    29.000000  60000.000000
75%    30.000000  62000.000000
max    35.000000  70000.000000

broadcasting

In [80]:
#increase the salary of all the employees by 5000
df["Salary"]+=5000

In [81]:
df["Salary"]

0    66000.0
1    76000.0
2    86000.0
3    78000.0
4        NaN
5    66000.0
Name: Salary, dtype: float64

In [82]:
df

      Name   Age Department   Salary
0    Alice  25.0         HR  66000.0
1      Bob  30.0         IT  76000.0
2  Charlie  35.0    Finance  86000.0
3    David   NaN         IT  78000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  66000.0

renaming the cols

In [83]:
df.rename(columns={"Department":"dept"},inplace=True)

In [84]:
df

      Name   Age     dept   Salary
0    Alice  25.0       HR  66000.0
1      Bob  30.0       IT  76000.0
2  Charlie  35.0  Finance  86000.0
3    David   NaN       IT  78000.0
4      Eve  29.0       HR      NaN
5    Alice  25.0       HR  66000.0

In [86]:
df["dept"].unique()

array(['HR', 'IT', 'Finance'], dtype=object)

In [87]:
df["dept"].value_counts()

dept
HR         3
IT         2
Finance    1
Name: count, dtype: int64

In [90]:
df["promoted_salary"]=df["Salary"]*3

In [91]:
df

      Name   Age     dept   Salary  promoted_salary
0    Alice  25.0       HR  66000.0         198000.0
1      Bob  30.0       IT  76000.0         228000.0
2  Charlie  35.0  Finance  86000.0         258000.0
3    David   NaN       IT  78000.0         234000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  66000.0         198000.0

datacleaning

In [ ]:
df.isnull().sum()

Name               0
Age                1
dept               0
Salary             1
promoted_salary    1
dtype: int64

In [ ]:
df.dropna(how="any") #what ever row has any nan or null value

      Name   Age     dept   Salary  promoted_salary
0    Alice  25.0       HR  66000.0         198000.0
1      Bob  30.0       IT  76000.0         228000.0
2  Charlie  35.0  Finance  86000.0         258000.0
5    Alice  25.0       HR  66000.0         198000.0

In [96]:
df

      Name   Age     dept   Salary  promoted_salary
0    Alice  25.0       HR  66000.0         198000.0
1      Bob  30.0       IT  76000.0         228000.0
2  Charlie  35.0  Finance  86000.0         258000.0
3    David   NaN       IT  78000.0         234000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  66000.0         198000.0

In [ ]:
df.dropna(how="all") #drop if all the values are null or nan

      Name   Age     dept   Salary  promoted_salary
0    Alice  25.0       HR  66000.0         198000.0
1      Bob  30.0       IT  76000.0         228000.0
2  Charlie  35.0  Finance  86000.0         258000.0
3    David   NaN       IT  78000.0         234000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  66000.0         198000.0

In [ ]:
#get rid of the missing values or fill those null values with most repeated values or average 


df["Age"].fillna(df["Age"].mean())
df["Salary"].fillna(df["Salary"].median())

#FORWARD FILL AND BACKWARD FILL

0    66000.0
1    76000.0
2    86000.0
3    78000.0
4    76000.0
5    66000.0
Name: Salary, dtype: float64

In [109]:
df["Age"].fillna(method="ffill")

C:\Users\kiran\AppData\Local\Temp\ipykernel_116776\310954073.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Age"].fillna(method="ffill")

0    25.0
1    30.0
2    35.0
3    35.0
4    29.0
5    25.0
Name: Age, dtype: float64

In [110]:
df["Age"].fillna(method="bfill")

C:\Users\kiran\AppData\Local\Temp\ipykernel_116776\3345892411.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Age"].fillna(method="bfill")

0    25.0
1    30.0
2    35.0
3    29.0
4    29.0
5    25.0
Name: Age, dtype: float64

In [112]:
# replace values
# randomly replace charlie aith kiran/
df["Name"]=df["Name"].replace("Charlie","kiran")

In [119]:
#dealing with duplicate values
# alice is twice
df_dup=df[df.duplicated(keep="first")]
df_dup

    Name   Age dept   Salary  promoted_salary
5  Alice  25.0   HR  66000.0         198000.0

In [121]:
df=df.drop_duplicates()
df

    Name   Age     dept   Salary  promoted_salary
0  Alice  25.0       HR  66000.0         198000.0
1    Bob  30.0       IT  76000.0         228000.0
2  kiran  35.0  Finance  86000.0         258000.0
3  David   NaN       IT  78000.0         234000.0
4    Eve  29.0       HR      NaN              NaN

In [125]:
#dealing with invalid values
#lamda impoertant

df["promoted_salary"]=df["promoted_salary"].apply(lambda x: x/10 if x>60000 else x)
df

    Name   Age     dept   Salary  promoted_salary
0  Alice  25.0       HR  66000.0          19800.0
1    Bob  30.0       IT  76000.0          22800.0
2  kiran  35.0  Finance  86000.0          25800.0
3  David   NaN       IT  78000.0          23400.0
4    Eve  29.0       HR      NaN              NaN

In [ ]:
#string functions
# name="kiran Ghosh"
# df[["firstname","lastname"]]=df["name"].str.split(" ")

In [126]:
#more about apply and lambda
def multiply_age(x):
    return x*2

df["Age"]=df["Age"].apply(multiply_age)

In [127]:
df

    Name   Age     dept   Salary  promoted_salary
0  Alice  50.0       HR  66000.0          19800.0
1    Bob  60.0       IT  76000.0          22800.0
2  kiran  70.0  Finance  86000.0          25800.0
3  David   NaN       IT  78000.0          23400.0
4    Eve  58.0       HR      NaN              NaN

In [ ]:
df["Age"]=df["Age"].apply(lambda x: x/2)

In [140]:
df

    Name   Age     dept   Salary  promoted_salary
0  Alice  25.0       HR  66000.0          19800.0
1    Bob  30.0       IT  76000.0          22800.0
2  kiran  35.0  Finance  86000.0          25800.0
3  David   NaN       IT  78000.0          23400.0
4    Eve  29.0       HR      NaN              NaN

In [142]:
#joins and merges

department_info = {
    "Dept": ["HR", "IT", "Finance"],
    "Location": ["New York", "San Francisco", "Chicago"],
    "Manager": ["Laura", "Steve", "Nina"]
}

df2=pd.DataFrame(department_info)
df2

      Dept       Location Manager
0       HR       New York   Laura
1       IT  San Francisco   Steve
2  Finance        Chicago    Nina

In [143]:
#concate
pd.concat([df,df2])

,Name,Age,dept,Salary,promoted_salary,Dept,Location,Manager
0,Alice,25.0,HR,66000.0,19800.0,NaN,NaN,NaN
1,Bob,30.0,IT,76000.0,22800.0,NaN,NaN,NaN
2,kiran,35.0,Finance,86000.0,25800.0,NaN,NaN,NaN
3,David,NaN,IT,78000.0,23400.0,NaN,NaN,NaN
4,Eve,29.0,HR,NaN,NaN,NaN,NaN,NaN
0,NaN,NaN,NaN,NaN,NaN,HR,New York,Laura
1,NaN,NaN,NaN,NaN,NaN,IT,San Francisco,Steve
2,NaN,NaN,NaN,NaN,NaN,Finance,Chicago,Nina

In [144]:
pd.concat([df,df2],axis=1)

,Name,Age,dept,Salary,promoted_salary,Dept,Location,Manager
0,Alice,25.0,HR,66000.0,19800.0,HR,New York,Laura
1,Bob,30.0,IT,76000.0,22800.0,IT,San Francisco,Steve
2,kiran,35.0,Finance,86000.0,25800.0,Finance,Chicago,Nina
3,David,NaN,IT,78000.0,23400.0,NaN,NaN,NaN
4,Eve,29.0,HR,NaN,NaN,NaN,NaN,NaN

In [148]:
# pd.merge([df,df2], on = "dept")

import file